ack
aircrack-ng
aom
apr
apr-util
argon2
aribb24
aspell
autoconf
bash
bash-completion@2
bfg
binutils
binwalk
bottom
brotli
ca-certificates
cairo
cifer
cjson
coreutils
curl
dav1d
dex2jar
dns2tcp
dsh
fcrackzip
ffmpeg
findutils
flac
fontconfig
foremost
freetds
freetype
frei0r
fribidi
gcc
gd
gettext
ghostscript
giflib
git
git-lfs
glib
gmp
gnupg
gnutls
graphite2
grep
harfbuzz
hashpump
highway
htop
hydra
icu4c
imagemagick
imath
isl
jasper
jbig2dec
john
jpeg-turbo
jpeg-xl
knock
krb5
lame
ldns
leptonica
libarchive
libass
libassuan
libavif
libb2
libbluray
libcbor
libde265
libdnet
libdshconfig
libevent
libfido2
libgcrypt
libgpg-error
libheif
libidn
libidn2
libimagequant
libksba
liblinear
liblqr
libmpc
libnghttp2
libogg
libomp
libpng
libpq
libraqm
libraw
librist
libsamplerate
libsndfile
libsodium
libsoxr
libssh
libssh2
libtasn1
libtiff
libtool
libunibreak
libunistring
libusb
libvidstab
libvmaf
libvorbis
libvpx
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
libzip
little-cms2
lua
lynx
lz4
lzo
m4
mbedtls
moreutils
mpdecimal
mpfr
mpg123
mysql-client
ncurses
netpbm
nettle
nmap
npth
numpy
oniguruma
openblas
opencore-amr
openexr
openjdk
openjpeg
openldap
openssh
openssl@3
openssl@3.0
opus
p11-kit
p7zip
pango
pcre
pcre2
php
pigz
pillow
pinentry
pixman
pngcheck
pv
python@3.11
qt@5
rav1e
readline
rename
rlwrap
rtmpdump
rubberband
screen
sdl2
sfnt2woff
sfnt2woff-zopfli
shared-mime-info
six
snappy
socat
speedtest-cli
speex
sqlite
sqlmap
srt
ssdeep
ssh-copy-id
svt-av1
tcl-tk
tcpflow
tcpreplay
tcptrace
tesseract
theora
tidy-html5
tmux
tree
ucspi-tcp
unbound
unixodbc
utf8proc
vbindiff
webp
woff2
x264
x265
xorgproto
xpdf
xvid
xz
zeromq
zimg
zlib
zopfli
zstd
background-music
blackhole-16ch
chromedriver
dash
jupyter-notebook-viewer
macfuse
opensc
qlcolorcode
qlimagesize
qlmarkdown
qlmobi
qlstephen
qlvideo
quicklook-csv
quicklook-json
