alacritty
apparency
background-music
blackhole-16ch
chromedriver
dash
eloston-chromium
ferdium
font-ubuntu-mono-nerd-font
jupyter-notebook-viewer
kap
macfuse
opensc
qlcolorcode
qlimagesize
qlmarkdown
qlmobi
qlstephen
qlvideo
quicklook-csv
quicklook-json
syntax-highlight
vscodium
